import akshare as ak
import pandas as pd
import time

time_sleep = 0.2

black_list = [
    [],
    [],
    [],
    [],
    [],
    [],
]


def get_stocks_code(df, code_col=2, name_col=3):
    stocks_code = []
    rows, cols = df.shape
    for row in range(rows):
        stocks_code.append([df.iloc[row, code_col], df.iloc[row, name_col]])
    return stocks_code


def get_industry_and_concept_of_stocks_v1(stocks_code, industry_stock, concept_stock, debug_num=20000):
    stocks_code_industry_concept, num_industry, num_concept = {}, {}, {}
    for i in range(min(len(stocks_code), debug_num)):
        st_code, st_name = stocks_code[i][0], stocks_code[i][1]
        stocks_code_industry_concept[st_code] = [[], [], st_name]

    for name, df in industry_stock.items():
        print(name)
        num_industry[name] = len(list(df[['代码']]))
        for i in range(min(len(stocks_code), debug_num)):
            st_code, st_name = stocks_code[i][0], stocks_code[i][1]

    for name, df in concept_stock.items():
        print(name)

    return stocks_code_industry_concept, num_industry, num_concept


def get_industry_and_concept_of_stocks(stocks_code, debug_num=20000):
    industry_list = ak.stock_board_industry_name_em()
    concept_list = ak.stock_board_concept_name_em()
    stocks_code_industry_concept, num_industry, num_concept = {}, {}, {}
    # print(industry_list)
    # print(concept_list)
    for i in range(min(len(stocks_code), debug_num)):
        st_code, st_name = stocks_code[i][0], stocks_code[i][1]
        stocks_code_industry_concept[st_code] = [[], [], st_name]

    for name in list(industry_list['板块名称']):
        print(name)
        try:
            industry_stock = ak.stock_board_industry_cons_em(name)
            num_industry[name] = len(list(industry_stock['代码']))
            # print([type(i) for i in industry_stock['代码']])
            for i in range(min(len(stocks_code), debug_num)):
                st_code, st_name = stocks_code[i][0], stocks_code[i][1]
                if st_code in list(industry_stock['代码']):
                    stocks_code_industry_concept[st_code][0].append(name)
                    # print('yes')

            time.sleep(time_sleep)
        except:
            print('stock_board_industry_cons_em error: ', name)

    for name in list(concept_list['板块名称']):
        print(name)
        try:
            concept_stocks = ak.stock_board_concept_cons_em(name)
            num_concept[name] = len(list(concept_stocks['代码']))
            for i in range(min(len(stocks_code), debug_num)):
                st_code, st_name = stocks_code[i][0], stocks_code[i][1]
                if st_code in list(concept_stocks['代码']):
                    stocks_code_industry_concept[st_code][1].append(name)
                    # print('yes')

            time.sleep(time_sleep)
        except:
            print('stock_board_concept_cons_em error: ', name)

    return stocks_code_industry_concept, num_industry, num_concept


def group_and_sort(target):
    industry_dic, concept_dic = {}, {}
    for key, val in target.items():
        industry, concept = val[0], val[1]
        for i in industry:
            industry_dic[i] = industry_dic.get(i, 0) + 1
        for i in concept:
            concept_dic[i] = concept_dic.get(i, 0) + 1
    return industry_dic, concept_dic


def export_df_dic(save_file, trade_date, df_dic):
    # 一天存一个
    file_path = save_file + '/' + str(trade_date) + '.xlsx'
    print(file_path)

    with pd.ExcelWriter(file_path, engine='openpyxl') as writer:
        for zt, df in df_dic.items():
            df.to_excel(writer, sheet_name=zt)


def export_df_dic_more(save_file, trade_date, industry_or_concept, df_dic):
    # 一天存多个
    file_path = save_file + '/' + str(trade_date) + '-' + str(industry_or_concept) + '.xlsx'
    print(file_path)

    with pd.ExcelWriter(file_path, engine='openpyxl') as writer:
        for zt, df in df_dic.items():
            df.to_excel(writer, sheet_name=zt)


def export_industry_or_concept_stock(save_file, trade_date, industry_or_concept, df, sheet_name):
    file_path = save_file + '/' + str(trade_date) + '-' + str(industry_or_concept) + '.xlsx'
    print(file_path)

    with pd.ExcelWriter(file_path, engine='openpyxl') as writer:
        df.to_excel(writer, sheet_name=sheet_name)


def load_zt_stocks(save_file, trade_date):
    file_path = save_file + '/' + str(trade_date) + '.xlsx'
    df_zt = pd.read_excel(file_path, sheet_name='涨停股池', dtype=str)
    print(df_zt.dtypes)
    df_zt_pvs = pd.read_excel(file_path, sheet_name='昨日涨停股池', dtype=str)
    df_zt_strong = pd.read_excel(file_path, sheet_name='强势股池', dtype=str)
    df_zt_sn = pd.read_excel(file_path, sheet_name='次新股池', dtype=str)
    df_zt_zbgc = pd.read_excel(file_path, sheet_name='炸板股池', dtype=str)
    df_zt_dtgc = pd.read_excel(file_path, sheet_name='跌停股池', dtype=str)

    return df_zt, df_zt_pvs, df_zt_strong, df_zt_sn, df_zt_zbgc, df_zt_dtgc


def load_industry_or_concept_stock(save_file, trade_date, industry_or_concept, sheet_name):
    file_path = save_file + '/' + str(trade_date) + '-' + str(industry_or_concept) + '.xlsx'
    df = pd.read_excel(file_path, sheet_name=sheet_name, dtype=str)

    return df


def load_stocks(save_file, action_date, stock_code):
    # file_path = './' + save_file + '/' + str(action_date) + '-' + str(stock_code) + '.xlsx'
    file_path = save_file + '/' + str(action_date) + '-' + str(stock_code) + '.xlsx'
    daily = pd.read_excel(file_path, sheet_name='daily')
    weekly = pd.read_excel(file_path, sheet_name='weekly')
    monthly = pd.read_excel(file_path, sheet_name='monthly')

    return daily, weekly, monthly


ggt_all = [
    ('02172', '微创脑科学'),
    ('09880', '优必选'),
    ('02252', '微创机器人-B'),
    ('01810', '小米集团-W'),
    ('01316', '耐世特'),
    ('00981', '中芯国际'),
    ('06682', '第四范式'),
    ('01860', '汇量科技'),
    ('01385', '上海复旦'),
    # ('02268', '药明合联'),
    # ('02498', '速腾聚创'),
    ('03896', '金山云'),
    ('00241', '阿里健康')
    # ('06181', '老铺黄金')
    # ('02556', '迈富时'),
    # ('03396', '联想控股'),
    # ('02533', '黑芝麻智能'),
    # ('01024', '快手-W'),
    # ('00700', '腾讯控股'),
    # ('00763', '中兴通讯'),
    # ('03738', '阜博集团'),
    # ('01359', '中国信达'),
    # ('02105', '来凯医药-B'),
    # ('01347', '华虹半导体'),
    # ('01952', '云顶新耀-B'),
    # ('02192', '医脉通'),
    # ('01686', '新意网集团'),
    # ('00696', '中国民航信息网络'),
    # ('01833', '平安好医生'),
    # ('01357', '美图公司'),
    # ('02013', '微盟集团'),
    # ('02171', '科济药业-B'),
    # ('06069', '盛业'),
    # ('09959', '联易融科技-W'),
    # ('09636', '九方智投控股'),
    # ('00220', '统一企业中国'),
    #
    # ('00762', '中国联通'),
    # ('09890', '中旭未来'),
    # ('01773', '天立国际控股'),
    # ('01888', '建滔积层板'),
    # ('00314', '思派健康'),
    #
    # ('06660', '艾美疫苗'),
    # ('01816', '中广核电力'),
    # ('01349', '复旦张江'),
    # ('06881', '中国银河'),
    # ('00322', '康师傅控股'),
    # ('09676', '十月稻田'),
    # ('00148', '建滔集团'),
    # ('00995', '安徽皖通高速公路'),
    # ('00270', '粤海投资'),
    # ('01942', '马可数字科技'),
    # ('01071', '华电国际电力股份'),
    # ('01585', '雅迪控股'),
    # ('09688', '再鼎医药'),
    #
    # ('00371', '北控水务集团'),
    # ('00552', '中国通信服务'),
    #
    # ('00327', '百富环球'),
    # ('01709', '德林控股'),
    # ('02858', '易鑫集团'),
    # ('09868', '小鹏汽车-W'),
    # ('00177', '江苏宁沪高速公路'),
    # ('02228', '晶泰控股-P'),
    # ('00323', '马鞍山钢铁股份'),
    # ('02157', '乐普生物-B'),
    # ('00440', '大新金融'),
    # ('00966', '中国太平'),
    # ('00998', '中信银行'),
    # ('00909', '明源云'),
    # ('02038', '富智康集团'),
    # ('00008', '电讯盈科'),
    # ('01877', '君实生物'),
    # ('01477', '欧康维视生物-B'),
    # ('06186', '中国飞鹤'),
    # ('03918', '金界控股'),
    # ('00968', '信义光能'),
    # ('06110', '滔搏'),
    # ('00728', '中国电信'),
    # ('00917', '趣致集团'),
    # ('01658', '邮储银行'),
    # ('02158', '医渡科技'),
    # ('09923', '移卡'),
    # ('01558', '东阳光长江药业'),
    # ('00011', '恒生银行'),
    # ('00187', '京城机电股份'),
    # ('09997', '康基医疗'),
    # ('06806', '申万宏源'),
    # ('02155', '森松国际'),
    # ('03958', '东方证券'),
    # ('00590', '六福集团'),
    # ('02356', '大新银行集团'),
    # ('01972', '太古地产'),
    # ('01405', '达势股份'),
    # ('01302', '先健科技'),
    # ('01675', '亚信科技'),
    # ('01515', '华润医疗'),
    # ('01801', '信达生物'),
    # ('06865', '福莱特玻璃'),
    # ('01788', '国泰君安国际'),
    # ('06639', '瑞尔集团'),
    # ('00489', '东风集团股份'),
    # ('09878', '汇通达网络'),
    # ('03868', '信义能源'),
    # ('01177', '中国生物制药'),
    # ('00902', '华能国际电力股份'),
    # ('00107', '四川成渝高速公路'),
    # ('09858', '优然牧业'),
    # ('00754', '合生创展集团'),
    # ('00576', '浙江沪杭甬'),
    # ('00934', '中石化冠德'),
    # ('06127', '昭衍新药'),
    # ('02273', '固生堂'),
    # ('06680', '金力永磁'),
    # ('01053', '重庆钢铁股份'),
    # ('00916', '龙源电力'),
    # ('01288', '农业银行'),
    # ('06066', '中信建投证券'),
    # ('01811', '中广核新能源'),
    # ('00144', '招商局港口'),
    # ('00553', '南京熊猫电子股份'),
    # ('00012', '恒基地产'),
    # ('02291', '心泰医疗'),
    # ('03323', '中国建材'),
    # ('03908', '中金公司'),
    # ('00836', '华润电力'),
    # ('01475', '日清食品'),
    # ('03618', '重庆农村商业银行'),
    # ('01635', '大众公用'),
    # ('06818', '中国光大银行'),
    # ('06185', '康希诺生物'),
    # ('00200', '新濠国际发展'),
    # ('02196', '复星医药'),
    # ('01336', '新华保险'),
    # ('03650', 'KEEP'),
    # ('02359', '药明康德'),
    # ('00868', '信义玻璃'),
    # ('00101', '恒隆地产'),
    # ('00853', '微创医疗'),
    # ('01988', '民生银行'),
    # ('01193', '华润燃气'),
    # ('01038', '长江基建集团'),
    # ('01274', '知行汽车科技'),
    # ('00683', '嘉里建设'),
    # ('00257', '光大环境'),
    # ('00384', '中国燃气'),
    # ('00688', '中国海外发展'),
    # ('02285', '泉峰控股'),
    # ('00345', 'VITASOY INT'),
    # ('01883', '中信国际电讯'),
    # ('01052', '越秀交通基建'),
    # ('03692', '翰森制药'),
    # ('02238', '广汽集团'),
    # ('00135', '昆仑能源'),
    # ('00548', '深圳高速公路股份'),
    # ('01910', '新秀丽'),
    # ('01928', '金沙中国有限公司'),
    # ('09885', '药师帮'),
    # ('03759', '康龙化成'),
    # ('02888', '渣打集团'),
    # ('06979', '珍酒李渡'),
    # ('00392', '北京控股'),
    # ('02453', '美中嘉和'),
    #
    # ('01798', '大唐新能源'),
    # ('00991', '大唐发电'),
    # ('00522', 'ASMPT'),
    # ('06855', '亚盛医药-B'),
    # ('02009', '金隅集团'),
    # ('02380', '中国电力'),
    # ('01113', '长实集团'),
    # ('02186', '绿叶制药'),
    # ('06666', '恒大物业'),
    # ('02678', '天虹国际集团'),
    # ('02343', '太平洋航运'),
    # ('01313', '华润建材科技'),
    # ('02402', '亿华通'),
    # ('00317', '中船防务'),
    # ('00586', '海螺创业'),
    # ('00659', '周大福创建'),
    # ('01310', '香港宽频'),
    # ('02318', '中国平安'),
    # ('00005', '汇丰控股'),
    # ('00895', '东江环保'),
    # ('00173', '嘉华国际'),
    # ('01128', '永利澳门'),
    # ('00010', '恒隆集团'),
    # ('02039', '中集集团'),
    # ('09993', '金辉控股'),
    # ('00512', '远大医药'),
    # ('01921', '达力普控股'),
    # ('02068', '中铝国际'),
    # ('03360', '远东宏信'),
    # ('00694', '北京首都机场股份'),
    # ('02555', '茶百道'),
    # ('01858', '春立医疗'),
    # ('06196', '郑州银行'),
    # ('00817', '中国金茂'),
    # ('00027', '银河娱乐'),
    #
    # ('01083', '港华智慧能源'),
    # ('01117', '现代牧业'),
    # ('09658', '特海国际'),
    # ('01196', '伟禄集团'),
    # ('00780', '同程旅行'),
    # ('01919', '中远海控'),
    # ('01513', '丽珠医药'),
    # ('00087', '太古股份公司B'),
    # ('03988', '中国银行'),
    # ('02388', '中银香港'),
    # ('03866', '青岛银行'),
    # ('00019', '太古股份公司A'),
    # ('09899', '网易云音乐'),
    # ('06178', '光大证券'),
    # ('00939', '建设银行'),
    # ('01199', '中远海运港口'),
    # ('02016', '浙商银行'),
    # ('03800', '协鑫科技'),
    #
    # ('00014', '希慎兴业'),
    # ('01963', '重庆银行'),
    # ('00412', '山高控股'),
    # ('00338', '上海石油化工股份'),
    # ('09987', '百胜中国'),
    # ('00867', '康哲药业'),
    # ('06160', '百济神州'),
    # ('00165', '中国光大控股'),
    # ('01610', '中粮家佳康'),
    # ('01448', '福寿园'),
    # ('09956', '安能物流'),
    # ('00002', '中电控股'),
    # ('01398', '工商银行'),
    # ('00777', '网龙'),
    # ('00656', '复星国际'),
    # ('03808', '中国重汽'),
    # ('06030', '中信证券'),
    # ('00119', '保利置业集团'),
    # ('03898', '时代电气'),
    # ('00347', '鞍钢股份'),
    # ('00267', '中信股份'),
    # ('02269', '药明生物'),
    # ('03328', '交通银行'),
    # ('00006', '电能实业'),
    # ('02877', '神威药业'),
    # ('02689', '玖龙纸业'),
    # ('00293', '国泰航空'),
    # ('02588', '中银航空租赁'),
    # ('03877', '中国船舶租赁'),
    # ('01458', '周黑鸭'),
    # ('01108', '凯盛新能'),
    # ('06698', '星空华文'),
    # ('00020', '商汤-W'),
    # ('01799', '新特能源'),
    # ('06055', '中烟香港'),
    # ('00956', '新天绿色能源'),
    # ('03900', '绿城中国'),
    # ('01876', '百威亚太'),
    # ('00719', '山东新华制药股份'),
    # ('02607', '上海医药'),
    # ('01855', '中庆股份'),
    # ('00874', '白云山'),
    # ('00941', '中国移动'),
    # ('00151', '中国旺旺'),
    # ('01766', '中国中车'),
    # ('02666', '环球医疗'),
    # ('01800', '中国交通建设'),
    # ('03669', '永达汽车'),
    # ('00316', '东方海外国际'),
    # ('06963', '阳光保险'),
    # ('03709', '赢家时尚'),
    # ('00363', '上海实业控股'),
    # ('00003', '香港中华煤气'),
    # ('01057', '浙江世宝'),
    # ('09863', '零跑汽车'),
    # ('00636', '嘉里物流'),
    # ('00388', '香港交易所'),
    # ('02162', '康诺亚-B'),
    # ('02096', '先声药业'),
    # ('00152', '深圳国际'),
    # ('02688', '新奥能源'),
    # ('06821', '凯莱英'),
    # ('00268', '金蝶国际'),
    # ('01992', '复星旅游文化'),
    # ('00390', '中国中铁'),
    # ('00083', '信和置业'),
    # ('09995', '荣昌生物'),
    # ('01171', '兖矿能源'),
    # ('01044', '恒安国际'),
    # ('02601', '中国太保'),
    # ('01997', '九龙仓置业'),
    # ('00066', '港铁公司'),
    # ('00855', '中国水务'),
    #
    # ('01157', '中联重科'),
    # ('00772', '阅文集团'),
    # ('03899', '中集安瑞科'),
    # ('00016', '新鸿基地产'),
    # ('01099', '国药控股'),
    # ('09989', '海普瑞'),
    # ('06837', '海通证券'),
    # ('06616', '环球新材国际'),
    # ('06049', '保利物业'),
    # ('03996', '中国能源建设'),
    # ('03969', '中国通号'),
    # ('03678', '弘业期货'),
    #
    # ('03339', '中国龙工'),
    # ('03320', '华润医药'),
    # ('02880', '辽港股份'),
    # ('02866', '中远海发'),
    # ('02517', '锅圈'),
    # ('02282', '美高梅中国'),
    # ('02255', '海昌海洋公园'),
    # ('01969', '中国春来'),
    # ('01821', 'ESR'),
    # ('01789', '爱康医疗'),
    # ('01776', '广发证券'),
    # ('01600', '天伦燃气'),
    # ('01528', '红星美凯龙'),
    # ('01375', '中州证券'),
    # ('01339', '中国人民保险集团'),
    # ('01209', '华润万象生活'),
    # ('01060', '阿里影业'),
    # ('01033', '中石化油服'),
    # ('01030', '新城发展'),
    # ('00992', '联想集团'),
    # ('00880', '澳博控股'),
    # ('00639', '首钢资源'),
    # ('00588', '北京北辰实业股份'),
    # ('00581', '中国东方集团'),
    # ('00570', '中国中药'),
    # ('00410', 'SOHO中国'),
    # ('00336', '华宝国际'),
    # ('00297', '中化化肥'),
    # ('00272', '瑞安房地产'),
    # ('00081', '中国海外宏洋集团'),
    # ('00004', '九龙仓集团'),
    # ('00001', '长和'),
    # ('02057', '中通快递-W'),
    # ('02378', '保诚'),
    # ('06936', '顺丰控股'),
    # ('06886', '华泰证券'),
    # ('02328', '中国财险'),
    # ('01070', 'TCL电子'),
    # ('00881', '中升控股'),
    # ('02400', '心动公司'),
    # ('02386', '中石化炼化工程'),
    # ('09696', '天齐锂业'),
    # ('01381', '粤丰环保'),
    # ('02602', '万物云'),
    # ('03633', '中裕能源'),
    # ('00142', '第一太平'),
    # ('00013', '和黄医药'),
    # ('01456', '国联证券'),
    # ('00341', '大家乐集团'),
    # ('06088', 'FIT HON TENG'),
    # ('01065', '天津创业环保股份'),
    # ('00179', '德昌电机控股'),
    # ('02218', '安德利果汁'),
    # ('00558', '力劲科技'),
    # ('00551', '裕元集团'),
    # ('01772', '赣锋锂业'),
    # ('00525', '广深铁路股份'),
    # ('03306', '江南布衣'),
    # ('00819', '天能动力'),
    # ('03311', '中国建筑国际'),
    # ('00598', '中国外运'),
    # ('02869', '绿城服务'),
    # ('00546', '阜丰集团'),
    # ('01908', '建发国际集团'),
    # ('01186', '中国铁建'),
    # ('06826', '昊海生物科技'),
    # ('01579', '颐海国际'),
    # ('03690', '美团-W'),
    # ('01109', '华润置地'),
    # ('06990', '科伦博泰生物-B'),
    # ('09969', '诺诚健华'),
    # ('01330', '绿色动力环保'),
    # ('01618', '中国中冶'),
    # ('09699', '顺丰同城'),
    # ('06099', '招商证券'),
    # ('09896', '名创优品'),
    # ('03990', '美的置业'),
    # ('00017', '新世界发展'),
    # ('03668', '兖煤澳大利亚'),
    # ('01907', '中国旭阳集团'),
    # ('02150', '奈雪的茶'),
    # ('00038', '第一拖拉机股份'),
    # ('06699', '时代天使'),
    # ('00857', '中国石油股份'),
    # ('00788', '中国铁塔'),
    # ('09666', '金科服务'),
    # ('01548', '金斯瑞生物科技'),
    # ('02407', '高视医疗'),
    # ('02338', '潍柴动力'),
    # ('02314', '理文造纸'),
    # ('09860', '艾迪康控股'),
    # ('02429', '友宝在线'),
    # ('01368', '特步国际'),
    # ('01812', '晨鸣纸业'),
    # ('01088', '中国神华'),
    # ('03613', '同仁堂国药'),
    # ('00883', '中国海洋石油'),
    # ('06098', '碧桂园服务'),
    # ('02015', '理想汽车-W'),
    # ('01093', '石药集团'),
    # ('01918', '融创中国'),
    # ('02145', '上美股份'),
    # ('06078', '海吉亚医疗'),
    # ('03319', '雅生活服务'),
    # ('01308', '海丰国际'),
    # ('01951', '锦欣生殖'),
    # ('02628', '中国人寿'),
    # ('02208', '金风科技'),
    # ('01898', '中煤能源'),
    # ('06683', '巨星传奇'),
    # ('00604', '深圳控股'),
    # ('00136', '中国儒意'),
    # ('02669', '中海物业'),
    # ('06869', '长飞光纤光缆'),
    # ('02233', '西部水泥'),
    # ('00168', '青岛啤酒股份'),
    # ('01341', '昊天国际建投'),
    # ('02727', '上海电气'),
    # ('00095', '绿景中国地产'),
    # ('00288', '万洲国际'),
    # ('06690', '海尔智家'),
    # ('00960', '龙湖集团'),
    # ('00467', '联合能源集团'),
    # ('02611', '国泰君安'),
    # ('01541', '宜明昂科-B'),
    # ('02550', '宜搜科技'),
    # ('06955', '博安生物'),
    # ('02169', '沧港铁路'),
    # ('00667', '中国东方教育'),
    # ('02419', '德康农牧'),
    # ('09966', '康宁杰瑞制药-B'),
    # ('00175', '吉利汽车'),
    # ('09988', '阿里巴巴-W'),
    # ('01880', '中国中免'),
    # ('02411', '百果园集团'),
    # ('09926', '康方生物'),
    # ('02367', '巨子生物'),
    # ('00123', '越秀地产'),
    # ('01072', '东方电气'),
    # ('00386', '中国石油化工股份'),
    # ('00460', '四环医药'),
    # ('00670', '中国东方航空股份'),
    # ('01882', '海天国际'),
    # ('01958', '北京汽车'),
    # ('00921', '海信家电'),
    # ('00861', '神州控股'),
    # ('00743', '亚洲水泥(中国)'),
    # ('01119', '创梦天地'),
    # ('00669', '创科实业'),
    # ('01114', '华晨中国'),
    # ('01836', '九兴控股'),
    # ('06808', '高鑫零售'),
    # ('01112', 'H&H国际控股'),
    # ('01066', '威高股份'),
    # ('02005', '石四药集团'),
    # ('01516', '融创服务'),
    # ('06198', '青岛港'),
    # ('01299', '友邦保险'),
    # ('00914', '海螺水泥'),
    # ('02333', '长城汽车'),
    # ('01999', '敏华控股'),
    # ('02128', '中国联塑'),
    # ('03380', '龙光集团'),
    # ('02313', '申洲国际'),
    # ('01361', '361度'),
    # ('09992', '泡泡玛特'),
    # ('09690', '途虎-W'),
    # ('00666', '瑞浦兰钧'),
    # ('00303', 'VTECH HOLDINGS'),
    # ('00631', '三一国际'),
    # ('06655', '华新水泥'),
    # ('00975', 'MONGOL MINING'),
    # ('01519', '极兔速递-W'),
    # ('02465', '龙蟠科技'),
    # ('02357', '中航科工'),
    # ('02469', '粉笔'),
    # ('02331', '李宁'),
    # ('00826', '天工国际'),
    # ('00354', '中国软件国际'),
    # ('00300', '美的集团'),
    # ('01797', '东方甄选'),
    # ('06969', '思摩尔国际'),
    # ('03888', '金山软件'),
    # ('00564', '郑煤机'),
    # ('01211', '比亚迪股份'),
    # ('02443', '汽车街'),
    # ('01138', '中远海能'),
    # ('01055', '中国南方航空股份'),
    # ('03998', '波司登'),
    # ('02883', '中海油田服务'),
    # ('02319', '蒙牛乳业'),
    # ('03347', '泰格医药'),
    # ('03968', '招商银行'),
    # ('01268', '美东汽车'),
    # ('01378', '中国宏桥'),
    # ('06060', '众安在线'),
    # ('01468', '京基金融国际'),
    # ('02121', '创新奇智'),
    # ('09633', '农夫山泉'),
    #
    # ('00811', '新华文轩'),
    # ('02202', '万科企业'),
    # ('09979', '绿城管理控股'),
    # ('00358', '江西铜业股份'),
    # ('00425', '敏实集团'),
    # ('01258', '中国有色矿业'),
    # ('03369', '秦港股份'),
    # ('01735', '中环新能源'),
    # ('09869', '海伦司'),
    # ('00291', '华润啤酒'),
    # ('02018', '瑞声科技'),
    # ('00753', '中国国航'),
    # ('06862', '海底捞'),
    # ('00189', '东岳集团'),
    # ('03309', '希玛医疗'),
    # ('02020', '安踏体育'),
    # ('01478', '丘钛科技'),
    # ('02382', '舜宇光学科技'),
    # ('02600', '中国铝业'),
    # ('03993', '洛阳钼业'),
    # ('01415', '高伟电子'),
    # ('02362', '金川国际'),
    # ('00535', '金地商置'),
    # ('01530', '三生制药'),
    # ('01929', '周大福'),
    # ('01164', '中广核矿业'),
    #
    # ('01896', '猫眼娱乐'),
    # ('00839', '中教控股'),
    # ('03933', '联邦制药'),
    # ('00856', '伟仕佳杰'),
    # ('01818', '招金矿业'),
    # ('01277', '力量发展'),
    # ('02618', '京东物流'),
    # ('01208', '五矿资源'),
    # ('02899', '紫金矿业'),
    # ('01691', 'JS环球生活'),
    # ('01787', '山东黄金'),
    # ('02487', '科笛-B'),
    # ('09922', '九毛九'),
    #
    # ('00990', '荣晖国际'),
    # ('00256', '冠城钟表珠宝'),
    # ('00285', '比亚迪电子'),
    # ('00710', '京东方精电'),
    # ('06618', '京东健康'),
    # ('03606', '福耀玻璃'),
    # ('02777', '富力地产'),
    # ('02099', '中国黄金国际'),
    # ('09626', '哔哩哔哩-W'),
    # ('00751', '创维集团')
]
